{
    "Conditions":  {
                       "Applications":  {
                                            "ApplicationFilter":  {
                                                                      "Mode":  null,
                                                                      "Rule":  null
                                                                  },
                                            "ExcludeApplications":  [

                                                                    ],
                                            "IncludeApplications":  [
                                                                        "All"
                                                                    ],
                                            "IncludeAuthenticationContextClassReferences":  [

                                                                                            ],
                                            "IncludeUserActions":  [

                                                                   ]
                                        },
                       "AuthenticationFlows":  {
                                                   "TransferMethods":  null
                                               },
                       "ClientAppTypes":  [
                                              "all"
                                          ],
                       "ClientApplications":  {
                                                  "ExcludeServicePrincipals":  null,
                                                  "IncludeServicePrincipals":  null,
                                                  "ServicePrincipalFilter":  {
                                                                                 "Mode":  null,
                                                                                 "Rule":  null
                                                                             }
                                              },
                       "Devices":  {
                                       "DeviceFilter":  {
                                                            "Mode":  null,
                                                            "Rule":  null
                                                        }
                                   },
                       "InsiderRiskLevels":  null,
                       "Locations":  {
                                         "ExcludeLocations":  [
                                                                  "111ae679-6849-4e45-8c7c-7f57c3018af7"
                                                              ],
                                         "IncludeLocations":  [
                                                                  "All"
                                                              ]
                                     },
                       "Platforms":  {
                                         "ExcludePlatforms":  null,
                                         "IncludePlatforms":  null
                                     },
                       "ServicePrincipalRiskLevels":  [

                                                      ],
                       "SignInRiskLevels":  [

                                            ],
                       "UserRiskLevels":  [

                                          ],
                       "Users":  {
                                     "ExcludeGroups":  [

                                                       ],
                                     "ExcludeGuestsOrExternalUsers":  {
                                                                          "ExternalTenants":  {
                                                                                                  "MembershipKind":  null
                                                                                              },
                                                                          "GuestOrExternalUserTypes":  null
                                                                      },
                                     "ExcludeRoles":  [

                                                      ],
                                     "ExcludeUsers":  [
                                                          "559259c6-4fa0-4b38-b448-5e67e5b3ca15"
                                                      ],
                                     "IncludeGroups":  [

                                                       ],
                                     "IncludeGuestsOrExternalUsers":  {
                                                                          "ExternalTenants":  {
                                                                                                  "MembershipKind":  null
                                                                                              },
                                                                          "GuestOrExternalUserTypes":  null
                                                                      },
                                     "IncludeRoles":  [

                                                      ],
                                     "IncludeUsers":  [
                                                          "All"
                                                      ]
                                 }
                   },
    "CreatedDateTime":  "\/Date(1755792366567)\/",
    "Description":  null,
    "DisplayName":  "EQU BL - CA 004 - Block Non-UK Access",
    "GrantControls":  {
                          "AuthenticationStrength":  {
                                                         "AllowedCombinations":  null,
                                                         "CombinationConfigurations":  null,
                                                         "CreatedDateTime":  null,
                                                         "Description":  null,
                                                         "DisplayName":  null,
                                                         "Id":  null,
                                                         "ModifiedDateTime":  null,
                                                         "PolicyType":  null,
                                                         "RequirementsSatisfied":  null
                                                     },
                          "BuiltInControls":  [
                                                  "block"
                                              ],
                          "CustomAuthenticationFactors":  [

                                                          ],
                          "Operator":  "OR",
                          "TermsOfUse":  [

                                         ]
                      },
    "Id":  "960e7a64-d920-418b-95ec-91c9ee891381",
    "ModifiedDateTime":  "\/Date(1762271328040)\/",
    "SessionControls":  {
                            "ApplicationEnforcedRestrictions":  {
                                                                    "IsEnabled":  null
                                                                },
                            "CloudAppSecurity":  {
                                                     "CloudAppSecurityType":  null,
                                                     "IsEnabled":  null
                                                 },
                            "DisableResilienceDefaults":  null,
                            "PersistentBrowser":  {
                                                      "IsEnabled":  null,
                                                      "Mode":  null
                                                  },
                            "SecureSignInSession":  {
                                                        "IsEnabled":  null
                                                    },
                            "SignInFrequency":  {
                                                    "AuthenticationType":  null,
                                                    "FrequencyInterval":  null,
                                                    "IsEnabled":  null,
                                                    "Type":  null,
                                                    "Value":  null
                                                }
                        },
    "State":  "enabled",
    "TemplateId":  null,
    "AdditionalProperties":  {

                             }
}
