{
    "Conditions":  {
                       "Applications":  {
                                            "ApplicationFilter":  {
                                                                      "Mode":  null,
                                                                      "Rule":  null
                                                                  },
                                            "ExcludeApplications":  [

                                                                    ],
                                            "IncludeApplications":  [
                                                                        "All"
                                                                    ],
                                            "IncludeAuthenticationContextClassReferences":  [

                                                                                            ],
                                            "IncludeUserActions":  [

                                                                   ]
                                        },
                       "AuthenticationFlows":  {
                                                   "TransferMethods":  null
                                               },
                       "ClientAppTypes":  [
                                              "all"
                                          ],
                       "ClientApplications":  {
                                                  "ExcludeServicePrincipals":  null,
                                                  "IncludeServicePrincipals":  null,
                                                  "ServicePrincipalFilter":  {
                                                                                 "Mode":  null,
                                                                                 "Rule":  null
                                                                             }
                                              },
                       "Devices":  {
                                       "DeviceFilter":  {
                                                            "Mode":  null,
                                                            "Rule":  null
                                                        }
                                   },
                       "InsiderRiskLevels":  null,
                       "Locations":  {
                                         "ExcludeLocations":  null,
                                         "IncludeLocations":  null
                                     },
                       "Platforms":  {
                                         "ExcludePlatforms":  null,
                                         "IncludePlatforms":  null
                                     },
                       "ServicePrincipalRiskLevels":  [

                                                      ],
                       "SignInRiskLevels":  [

                                            ],
                       "UserRiskLevels":  [

                                          ],
                       "Users":  {
                                     "ExcludeGroups":  [

                                                       ],
                                     "ExcludeGuestsOrExternalUsers":  {
                                                                          "ExternalTenants":  {
                                                                                                  "MembershipKind":  null
                                                                                              },
                                                                          "GuestOrExternalUserTypes":  null
                                                                      },
                                     "ExcludeRoles":  [

                                                      ],
                                     "ExcludeUsers":  [

                                                      ],
                                     "IncludeGroups":  [

                                                       ],
                                     "IncludeGuestsOrExternalUsers":  {
                                                                          "ExternalTenants":  {
                                                                                                  "MembershipKind":  null
                                                                                              },
                                                                          "GuestOrExternalUserTypes":  null
                                                                      },
                                     "IncludeRoles":  [

                                                      ],
                                     "IncludeUsers":  [
                                                          "All"
                                                      ]
                                 }
                   },
    "CreatedDateTime":  "\/Date(1751979670794)\/",
    "Description":  null,
    "DisplayName":  "EQU BL - CA 003 - Session Reauthenitcation",
    "GrantControls":  {
                          "AuthenticationStrength":  {
                                                         "AllowedCombinations":  null,
                                                         "CombinationConfigurations":  null,
                                                         "CreatedDateTime":  null,
                                                         "Description":  null,
                                                         "DisplayName":  null,
                                                         "Id":  null,
                                                         "ModifiedDateTime":  null,
                                                         "PolicyType":  null,
                                                         "RequirementsSatisfied":  null
                                                     },
                          "BuiltInControls":  null,
                          "CustomAuthenticationFactors":  null,
                          "Operator":  null,
                          "TermsOfUse":  null
                      },
    "Id":  "5bd216bd-203c-4de1-a2dd-89fcdde0d8bb",
    "ModifiedDateTime":  "\/Date(1756391031901)\/",
    "SessionControls":  {
                            "ApplicationEnforcedRestrictions":  {
                                                                    "IsEnabled":  null
                                                                },
                            "CloudAppSecurity":  {
                                                     "CloudAppSecurityType":  null,
                                                     "IsEnabled":  null
                                                 },
                            "DisableResilienceDefaults":  null,
                            "PersistentBrowser":  {
                                                      "IsEnabled":  null,
                                                      "Mode":  null
                                                  },
                            "SecureSignInSession":  {
                                                        "IsEnabled":  null
                                                    },
                            "SignInFrequency":  {
                                                    "AuthenticationType":  "primaryAndSecondaryAuthentication",
                                                    "FrequencyInterval":  "timeBased",
                                                    "IsEnabled":  true,
                                                    "Type":  "days",
                                                    "Value":  7
                                                }
                        },
    "State":  "enabled",
    "TemplateId":  null,
    "AdditionalProperties":  {

                             }
}
